In [15]:
import sys
import os
import sqlite3 as sq
import pandas as pd

In [16]:
InputFileName1='Retrieve_Profit_And_Loss.csv'
InputFileDir1='C:/VKHCG/04-Clark/01-Retrieve/01-EDS/01-R'

#OutputFileName=
#OutputFileDir = 'C:/VKHCG/04-Clark/02-Assess/01-EDS/02-Python'

DataBaseName='clark.db'
DataBaseDir = 'C:/VKHCG/04-Clark/02-Assess/SQLite'

In [17]:
sDatabaseName=DataBaseDir + '/' + DataBaseName
conn = sq.connect(sDatabaseName)

In [18]:
### Import Financial Data
sFileName1=InputFileDir1 + '/' + InputFileName1
print('################################')
print('Loading :',sFileName1)

################################
Loading : C:/VKHCG/04-Clark/01-Retrieve/01-EDS/01-R/Retrieve_Profit_And_Loss.csv

In [19]:
FinancialRawData=pd.read_csv(sFileName1,header=0,low_memory=False, encoding="latin-1")
FinancialData=FinancialRawData
print('Loaded Company :',FinancialData.columns.values)

Loaded Company : ['QTR' 'TypeOfEntry' 'ProductClass1' 'ProductClass2' 'ProductClass3'
 'Amount' 'QTY']

In [20]:
FinancialData.head()

,QTR,TypeOfEntry,ProductClass1,ProductClass2,ProductClass3,Amount,QTY
0,2017Q02,Cost of Sales,Hot Blanket,NaN,NaN,2989.20,12000.0
1,2017Q02,Cost of Sales,Kitty Box,NaN,NaN,19928.00,30000.0
2,2017Q02,Cost of Sales,Maxi Dog,NaN,NaN,34874.00,15000.0
3,2017Q02,Cost of Sales,Muis Huis,NaN,NaN,29892.00,4000.0
4,2017Q02,Cost of Sales,Water Jug,NaN,NaN,199.28,180000.0

In [21]:
FinancialData.shape

(2442, 7)

In [22]:
sTable='Assess-Financials'
print('Storing :',sDatabaseName,' Table:',sTable)
FinancialData.to_sql(sTable, conn, if_exists="replace")

Storing : C:/VKHCG/04-Clark/02-Assess/SQLite/clark.db  Table: Assess-Financials

In [23]:
print(FinancialData.head())
print('Rows : ',FinancialData.shape[0])

       QTR    TypeOfEntry ProductClass1 ProductClass2 ProductClass3    Amount  \
0  2017Q02  Cost of Sales   Hot Blanket           NaN           NaN   2989.20
1  2017Q02  Cost of Sales     Kitty Box           NaN           NaN  19928.00
2  2017Q02  Cost of Sales      Maxi Dog           NaN           NaN  34874.00
3  2017Q02  Cost of Sales     Muis Huis           NaN           NaN  29892.00
4  2017Q02  Cost of Sales     Water Jug           NaN           NaN    199.28

        QTY
0   12000.0
1   30000.0
2   15000.0
3    4000.0
4  180000.0
Rows :  2442